Revit 2027 API
BuiltInFailures.UniqueElementFailures.ProhibitUniqueElementDeletion Property
 Internal setting '%1!s!' is required by Revit and has been deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProhibitUniqueElementDeletion { get; }
Public Shared ReadOnly Property ProhibitUniqueElementDeletion As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProhibitUniqueElementDeletion {
	FailureDefinitionId^ get ();
}
static member ProhibitUniqueElementDeletion : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.UniqueElementFailures Class
Autodesk.Revit.DB Namespace